mathe/teilbarkeitsrelation.html
---
layout: page
title: Teilbarkeitsrelation
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Teilbarkeitsrelation</h2>
<div class="outline-text-2" id="text-1">
<p>
Die Relation \(| \subseteq \mathbb{Z}\setminus \\{0\\} \times \mathbb{Z}\)
mit \(x|y :\Longleftrightarrow \exists z \in \mathbb{Z}: zx = y\) heißt
<i>Teilbarkeitsrelation</i>. Gilt \(x|y\), so sagt man "\(x\) teilt \(y\)" oder
"\(y\) ist (natürliches) Vielfaches von \(x\)".
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Eigenschaften</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>die Teilbarkeitsrelation ist eine
<i>Ordnungsrelation</i>. Es gilt

<ul class="org-ul">
<li>Transititivität:
\(\forall a,b,c \in \mathbb{Z}: (a|b \wedge b|c) \Rightarrow a|c\)
</li>
<li>Reflexivität: \(\forall a \in \mathbb{Z}: a|a\)
</li>
<li>Antisymmetrie:
\(\forall a,b \in \mathbb{Z}: (a|b \wedge b|a) \Rightarrow a = b\)
</li>
</ul>
</li>

<li>ein Teiler von \(a\) teilt auch Vielfache von \(a\), d.h. es gilt:
\(\forall a,d,\alpha \in \mathbb{Z}: d|a \Rightarrow d|\alpha a\)
</li>
<li>ein Teiler von \(a\) und \(b\) teilt auch Vielfache von \(a\) und \(b\), d.h.
es gilt:
\(\forall a,b,d,\alpha,\beta \in \mathbb{Z}: d|a \wedge d|b \Rightarrow d|(\alpha a + \beta b)\)
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> gemeinsamer Teiler</h2>
<div class="outline-text-2" id="text-2">
<p>
\(d \in \mathbb{Z} \setminus \\{0\\}\) heißt genau dann <i>gemeinsamer
Teiler</i> von \(a \in \mathbb{Z}\) und \(b \in \mathbb{Z}\), wenn \(d|a\) und
\(d|b\) gilt.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Größter gemeinsamer Teiler</h2>
<div class="outline-text-2" id="text-3">
<p>
Ein <i>gemeinsamer Teiler</i>
heißt <i>größter gemeinsamer Teiler</i> (auch <i>ggT</i> oder engl. <i>gcd</i> für
<i>gretests common divisor</i>), wenn
\(\forall e \in \mathbb{Z} \setminus \\{0\\}: (e|a \wedge e|b) \Rightarrow e|d\)
gilt.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> klassischer euklidischer Algorithmus</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<b>ges:</b> \(\gcd(a,b)\), wobei oBdA \(a > b\) gilt.
</p>

<p>
<b>Idee:</b> Wiederholte Subtraktion: Subtrahiere die kleiner Zahl \(b\) von
der größere Zahl \(a\) und bestimme den Rest \(a-b\). Suche danach weiter
(auf dieselbe Weise nach) dem ggt von der kleineren Zahl \(b\) und \(a-b\)
(der Algorithmus funktioniert, da jeder Teiler von \(b\) und \(a-b\) teilt
auch \(a\)).
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> neuer euklidischer Algorithmus</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<b>ges:</b> \(\gcd(a,b)\), wobei oBdA \(a > b\) gilt.
</p>

<p>
<b>Idee:</b> Wiederholte <i>Division mit Rest</i>: Teile die
größere Zahl \(a\) durch die kleinere Zahl \(b\) und bestimme den Rest \(r\)
dieser Division. Danach suche weiter (auf dieselbe Weise) nach dem ggT
von der kleineren Zahl \(b\) und \(r\) (der Algorithmus funktioniert, da
\(a-r\) Vielfaches von \(b\) ist und somit jeder Teiler von \(b\) auch \(a-r\)
teilt).
</p>

<p>
Der euklidische Algorithmus liefert Zahlen
\(\alpha, \beta \in \mathbb{Z}\), mit denen sich \(\gcd(a,b)\) als
Linearkombination von \(a\) und \(b\) darstellen lässt, d.h. es gilt
\(\alpha a + \beta b = \gcd (a,b)\). Dies kann man mit dem erweiterten
euklidischen Algorithmus bestimmen.
</p>
</div>
</div>
</div>
